In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [*'1122'], 'B': '2 13 21 123'.split()})
df = df.astype(str)
df

   A    B
0  1    2
1  1   13
2  2   21
3  2  123

In [3]:
foo = (
       df.apply(lambda x:x.A in x.B,axis = 1 )
         .map({True:'Y',False:'N'})
)
foo

0    N
1    Y
2    Y
3    Y
dtype: object

In [4]:
df = df.assign(C = foo)
df

   A    B  C
0  1    2  N
1  1   13  Y
2  2   21  Y
3  2  123  Y

In [5]:
foo = [m in n for m,n in zip(df.A,df.B)]
foo

[False, True, True, True]

In [7]:
df = df.assign(C = foo)
df

   A    B      C
0  1    2  False
1  1   13   True
2  2   21   True
3  2  123   True

In [8]:
df.C = df.C.map({True:'Y',False:'N'})
df

   A    B  C
0  1    2  N
1  1   13  Y
2  2   21  Y
3  2  123  Y

In [ ]:
def func(d):
    foo = []
    x = d.B.str.contains(f'{d.A}')
    if x == True:
        foo.append('Y')
    else :
        foo.append('N')
    return foo

In [ ]:
foo = df.B.str.contains(f'{df.A}')
foo

In [ ]:
foo = [m in n for m,n in zip(df.A,df.B)]
foo

In [ ]:
foo1 = map({True:'Y',False:'N'},foo)
foo1

In [ ]:
foo1.to_list()

In [6]:
df = df.assign(C = foo)
df

AttributeError: 'list' object has no attribute 'map'

In [ ]:
df.C = df.C.map({True:'Y',False:'N'})
df